Repository: winterzxzz/smart_toeic_flutter
Catalog: lib/language/l10n/intl_*.arb
Languages: vi

# onboarding_title
source: Thank You For Trusting TOEIC Test Pro
vi: Cảm ơn bạn đã tin tưởng

# onboarding_description
source: The best app for TOEIC test-takers
vi: Ứng dụng luyện TOEIC tốt nhất

# login_title
source: Welcome to Smart TOEIC Prep
vi: Chào mừng đến TOEIC Thông Minh

# reset_password_title
source: Reset your password
vi: Đặt lại mật khẩu

# login_description
source: Login to access our comprehensive TOEIC preparation resources
vi: Đăng nhập để luyện thi TOEIC

# send_button
source: Send
vi: Gửi

source: Back to login
vi: Về đăng nhập

# reset_password_description
source: Enter your email and we will send you a link to reset your password
vi: Nhập email để đặt lại mật khẩu

# register_description
source: Create an account to access our comprehensive TOEIC preparation resources
vi: Tạo tài khoản để luyện TOEIC

# email_hint
source: Enter your email
vi: Nhập email

# password_label
source: Password
vi: Mật khẩu

# password_hint
source: Enter your password
vi: Nhập mật khẩu

# name_label
source: Name
vi: Tên

# name_hint
source: Enter your name
vi: Nhập tên

source: Forgot Password?
vi: Quên mật khẩu?

# login_button
source: Login
vi: Đăng nhập

# register_button
source: Register
vi: Đăng ký

# dont_have_account
source: Don't have an account?
vi: Chưa có tài khoản?

# already_have_account
source: Already have an account?
vi: Đã có tài khoản?

# empty_email_error
source: Please input Email
vi: Vui lòng nhập email

# empty_password_error
source: Please input password
vi: Vui lòng nhập mật khẩu

# empty_confirm_password_error
source: Please input confirm password
vi: Vui lòng nhập lại mật khẩu

# invalid_email_error
source: Email format is incorrect
vi: Email không hợp lệ

# email_exist_error
source: Email does not exist
vi: Email không tồn tại

# email_taken_error
source: Email has already taken
vi: Email đã dùng

# password_length_error
source: Password must have 6-30 characters
vi: Mật khẩu 6-30 ký tự

# confirm_password_length_error
source: Confirm password must have 6-30 characters
vi: Nhập lại mật khẩu 6-30 ký tự

# invalid_password_error
source: Password must have text, number and special character
vi: Mật khẩu cần chữ, số và ký tự đặc biệt

# invalid_confirm_password_error
source: Confirm password must have text, number and special character
vi: Nhập lại mật khẩu cần chữ, số và ký tự đặc biệt

# confirm_password_match_error
source: Confirm password and password do not match
vi: Mật khẩu không khớp

# ai_render_description
source: Advanced AI-powered tools to enhance your TOEIC preparation experience.
vi: Công cụ AI nâng cao giúp luyện thi TOEIC hiệu quả.

# flashcards_description
source: Interactive flashcards to boost your vocabulary and language skills efficiently.
vi: Flashcards tương tác giúp tăng từ vựng nhanh.

# practice_exams_description
source: Realistic TOEIC practice exams to assess and improve your test-taking abilities.
vi: Đề thi TOEIC thực tế để luyện tập.

# result_analysis_description
source: Detailed analysis of your exam performance to identify strengths and areas for improvement.
vi: Phân tích chi tiết kết quả thi TOEIC.

source: Practice
vi: Luyện tập

source: Exam Preparation
vi: Ôn thi

source: Listening
vi: Nghe

source: Test
vi: Bài thi

source: Set Flashcard
vi: Bộ thẻ từ

source: Test Online
vi: Thi online

source: Blogs
vi: Blog

source: Premium
vi: Nâng cấp

source: Settings
vi: Cài đặt

source: Upgrade Account
vi: Nâng cấp tài khoản

source: Choose the plan that's right for you
vi: Chọn gói phù hợp

source: Enhance your TOEIC skills with unique features
vi: Nâng cao TOEIC với tính năng đặc biệt

source: Premium Account
vi: Tài khoản nâng cấp

source: Expiration date
vi: Ngày hết hạn

source: Renew
vi: Gia hạn

source: Free Plan
vi: Gói miễn phí

source: Take TOEIC tests
vi: Làm bài TOEIC

source: Score and save results
vi: Chấm điểm & lưu kết quả

source: Create flashcard sets
vi: Tạo bộ thẻ từ

source: Access existing flashcards
vi: Xem thẻ từ có sẵn

source: Access blog
vi: Xem blog

source: AI auto-fill
vi: AI tự động điền

source: AI question explanations
vi: AI giải thích câu hỏi

source: Personal analytics
vi: Phân tích cá nhân

source: Quizzes and reminders
vi: Câu hỏi & nhắc nhở

source: Premium Plan
vi: Gói nâng cấp

# premium_plan_description
source: Unlock all features and enhance your TOEIC preparation experience.
vi: Mở khóa toàn bộ tính năng.

source: Still have questions?
vi: Cần hỗ trợ?

source: Contact us for support
vi: Liên hệ hỗ trợ

source: Contact Support
vi: Liên hệ hỗ trợ

source: Contact Us
vi: Liên hệ

source: Upgrade
vi: Nâng cấp

source: Free
vi: Miễn phí

source: Recommend
vi: Đề xuất

source: minute
vi: phút

source: minutes
vi: phút

source: No limit
vi: Không giới hạn

source: Tests
vi: Bài thi

source: All
vi: Tất cả

source: Exam
vi: Đề thi

source: Mini-Exam
vi: Thi nhanh

# set_flashcard_title
source: Set Flashcard
vi: Bộ thẻ từ

source: My List
vi: Danh sách của tôi

source: Studying
vi: Đang học

source: Create New Flashcard Set
vi: Tạo bộ thẻ từ mới

source: Create New Flashcard
vi: Tạo thẻ từ mới

source: Word Learned
vi: Từ đã học

source: Last Studied
vi: Học lần cuối

source: to reviews
vi: Cần ôn tập

# blogs_title
source: Blogs
vi: Blog

source: Search Blogs...
vi: Tìm blog...

# no_blogs
source: No blogs found
vi: Không có blog

source: Read More
vi: Xem thêm

source: Target Score
vi: Mục tiêu điểm

source: History
vi: Lịch sử

source: Analysis
vi: Phân tích

source: Logout
vi: Đăng xuất

source: Are you sure?
vi: Bạn chắc chắn?

# bio_label
source: Bio
vi: Giới thiệu

# bio_hint
source: Enter your bio
vi: Nhập giới thiệu

source: Reading Target
vi: Mục tiêu Reading

source: Reading Current
vi: Điểm Reading hiện tại

source: Listening Target
vi: Mục tiêu Listening

source: Listening Current
vi: Điểm Listening hiện tại

source: Update Profile
vi: Cập nhật hồ sơ

source: Update Target Score
vi: Cập nhật mục tiêu điểm

source: Reading Target Score
vi: Điểm Reading mục tiêu

source: Listening Target Score
vi: Điểm Listening mục tiêu

source: Update
vi: Cập nhật

source: Display Theme
vi: Giao diện

source: Follow System
vi: Theo hệ thống

source: Light Mode
vi: Sáng

source: Dark Mode
vi: Tối

source: System Mode
vi: Tự động

source: Theme Color
vi: Màu chủ đề

source: Dynamic Color
vi: Màu động

source: History Test
vi: Lịch sử thi

source: No data found
vi: Không có dữ liệu

source: TOEIC Performance Dashboard
vi: Bảng điểm TOEIC

source: Analysis Your Score
vi: Phân tích điểm

source: Attempt Count
vi: Số lần làm

source: attempts
vi: lần

source: level
vi: Cấp độ

source: min
vi: phút

source: Last time taken
vi: Lần làm gần nhất

source: Full
vi: Đầy đủ

source: Select Part to Practice
vi: Chọn phần luyện tập

# practive_part_tips
source: Tip: The form of partial practice and choosing the appropriate time will help you focus on solving the correct questions instead of being under pressure to complete the test.
vi: Mẹo: Hình thức luyện tập từng phần và chọn mức thời gian phù hợp sẽ giúp bạn tập trung vào giải đúng các câu hỏi thay vì phải chịu áp lực hoàn thành bài thi.

source: Limit Time
vi: Giới hạn thời gian

# limit_time_hint
source: Leave blank to do the test without time limit
vi: Để trống nếu không giới hạn

# practice_button
source: Practice
vi: Luyện tập

# full_mode_tips
source: Tip: The form of partial practice and choosing the appropriate time will help you focus on solving the correct questions instead of being under pressure to complete the test.
vi: Mẹo: Hình thức luyện tập từng phần và chọn mức thời gian phù hợp sẽ giúp bạn tập trung vào giải đúng các câu hỏi thay vì phải chịu áp lực hoàn thành bài thi.

source: Start Test
vi: Bắt đầu thi

source: Checking Payment Status...
vi: Đang kiểm tra thanh toán...

source: Congratulations!
vi: Chúc mừng!

source: Your account has been successfully upgraded.
vi: Tài khoản đã nâng cấp thành công.

source: Return to Home
vi: Về trang chủ

# an_error_occured_while_checking_payment_status
source: An error occurred while checking payment status.
vi: Có lỗi khi kiểm tra thanh toán.

source: Cannot open URL
vi: Không mở được liên kết

source: Exit
vi: Thoát

# are_you_sure_exit
source: Are you sure you want to exit?
vi: Bạn chắc chắn muốn thoát?

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

source: Great!
vi: Tuyệt vời!

source: Try Harder!
vi: Cố gắng hơn!

source: You answered correctly!
vi: Bạn trả lời đúng!

source: You answered incorrectly!
vi: Bạn trả lời sai!

source: Try Again
vi: Thử lại

source: Next Question
vi: Câu tiếp

source: Hard to Remember
vi: Khó nhớ

source: Relatively Hard
vi: Khá khó

source: Easy to Remember
vi: Dễ nhớ

source: Very Easy to Remember
vi: Rất dễ nhớ

source: What is your confidence level?
vi: Bạn tự tin mức nào?

source: Matching Word
vi: Ghép từ

# you_matched_correct_all_words
source: You matched correct all words!, Continue with other forms!
vi: Bạn đã ghép đúng! Tiếp tục các dạng khác!

source: Enter English Word
vi: Nhập từ tiếng Anh

source: Check
vi: Kiểm tra

source: Answer
vi: Đáp án

source: Order Word to Correct
vi: Sắp xếp từ đúng

source: Loading...
vi: Đang tải...

source: Select Description
vi: Chọn mô tả

source: Select Meaning
vi: Chọn nghĩa

source: Enter Vietnamese Word
vi: Nhập từ tiếng Việt

source: words
vi: từ

source: Practive Flashcard
vi: Luyện thẻ từ

source: Status Explanation
vi: Giải thích trạng thái

source: Decay Score
vi: Điểm giảm dần

# practice_pronoun
source: Practice Pronunciation
vi: Luyện phát âm

source: Type what you hear...
vi: Nhập những gì bạn nghe...

source: Transcript Test
vi: Bản ghi bài thi

source: Question List
vi: Danh sách câu hỏi

source: Question
vi: Câu hỏi

source: Correct!
vi: Đúng!

source: Next
vi: Tiếp

source: Finish
vi: Kết thúc

source: You
vi: Bạn

source: Result
vi: Kết quả

source: Filter
vi: Lọc

source: Test Listening
vi: Thi nghe

source: Click to start test
vi: Bấm để bắt đầu thi

source: Update Error
vi: Lỗi cập nhật

# save_button
source: Save
vi: Lưu

source: Title
vi: Tiêu đề

source: Description
vi: Mô tả

source: Add new word
vi: Thêm từ mới

source: Practice flashcards
vi: Luyện thẻ từ

source: View randomly
vi: Xem ngẫu nhiên

# no_words_in_flash_card
source: No words in this flashcard set
vi: Không có từ trong bộ thẻ

source: Edit
vi: Sửa

source: Delete
vi: Xóa

# are_you_sure_delete_flashcard
source: Are you sure you want to delete this flashcard?
vi: Bạn chắc chắn muốn xóa Flashcard?

source: Translate
vi: Dịch

source: Definition
vi: Định nghĩa

source: Example Sentences
vi: Câu ví dụ

source: Note
vi: Ghi chú

source: Word
vi: Từ

source: Meaning
vi: Nghĩa

source: Example
vi: Ví dụ

source: Pronunciation
vi: Phát âm

source: Part of speech
vi: Loại từ

# ai_filling
source: AI is filling...
vi: AI đang điền...

source: Fill by AI
vi: Điền bằng AI

source: Hide Answer
vi: Ẩn đáp án

source: Show Answer
vi: Hiện đáp án

source: Previous
vi: Trước

# click_to_reveal
source: Click to reveal definition
vi: Bấm để xem định nghĩa

source: Analysis Score
vi: Phân tích điểm

source: Overall Score
vi: Tổng điểm

source: Listening Score
vi: Điểm Listening

source: Reading Score
vi: Điểm Reading

source: Listening Score Explanation
vi: Giải thích điểm Listening

source: Reading Score Explanation
vi: Giải thích điểm Reading

source: Listening Score Explanation Content
vi: Nội dung giải thích điểm Listening

source: Accuracy by Part
vi: Độ chính xác theo phần

source: Analysis Time
vi: Thời gian phân tích

# time_per_question
source: S/Question
vi: Giây/câu

source: Category
vi: Danh mục

source: Value
vi: Giá trị

source: All Parts
vi: Tất cả phần

source: Category Accuracy Chart
vi: Biểu đồ độ chính xác

source: Question Types
vi: Loại câu hỏi

source: Count
vi: Số lượng

# are_you_sure_submit_test
source: Are you sure you want to submit the test?
vi: Bạn chắc chắn muốn nộp bài?

source: Please wait...
vi: Vui lòng chờ...

source: Submitting...
vi: Đang nộp...

source: View Answer
vi: Xem đáp án

source: Back to test page
vi: Về trang thi

source: Correct answer
vi: Đáp án đúng

source: Upgrade to use AI
vi: Nâng cấp để dùng AI

source: Create answer by AI
vi: Tạo đáp án bằng AI

source: Error
vi: Lỗi

source: Success
vi: Thành công

# analysis_your_score_success
source: Analysis your score successfully
vi: Phân tích điểm thành công

source: Language
vi: Ngôn ngữ

# vietnamese
source: Tiếng Việt
vi: Vietnamese

source: Home
vi: Trang chủ

source: Test Practice
vi: Thi luyện

source: Account
vi: Tài khoản

source: Explanation
vi: Giải thích

source: Delete Flashcard
vi: Xóa thẻ từ

source: Edit Flashcard Set
vi: Sửa bộ thẻ từ

source: Photographs
vi: Hình ảnh

source: Identify actions
vi: Nhận dạng hành động

source: Describe scenes
vi: Mô tả cảnh

source: Question-Response
vi: Câu hỏi-Trả lời

source: Short answers
vi: Câu trả lời ngắn

source: Yes/No questions
vi: Câu hỏi có đáp án

source: Wh- questions
vi: Câu hỏi có đáp án

source: Conversations
vi: Hội thoại

source: Multiple speakers
vi: Nhiều người nói

source: Purpose
vi: Mục đích

# speaker_attitude
source: Speaker's attitude
vi: Tình cảm của người nói

source: Chart/Visual reference
vi: Biểu đồ/Hình ảnh

source: Talks
vi: Hội thoại

source: Single speaker
vi: Người nói

source: Main idea
vi: Ý chính

source: Details
vi: Chi tiết

source: Charts/Visuals
vi: Biểu đồ/Hình ảnh

source: Inference
vi: Suy luận

source: Incomplete Sentences
vi: Câu không hoàn chỉnh

source: Grammar
vi: Ngữ pháp

source: Vocabulary
vi: Từ vựng

source: Text Completion
vi: Hoàn thành văn bản

source: Passages
vi: Bài viết

source: Reading Comprehension
vi: Đọc hiểu

source: Single passage
vi: Bài viết

source: Double passage
vi: Bài viết

source: Triple passage
vi: Bài viết

source: Cohesion
vi: Liên kết

source: Daily Reminder
vi: Nhắc nhở hàng ngày

# daily_reminder_description
source: Check the app today to improve your TOEIC skills!
vi: Kiểm tra ứng dụng hàng ngày để học tập hiệu quả hơn!

# set_time
source: Change Time
vi: Chọn thời gian

source: Difficulty Rate
vi: Mức độ khó

source: Time
vi: Thời gian

source: Number of Questions
vi: Số câu hỏi

source: Number of Correct Answers
vi: Số câu trả lời đúng

source: Number of Wrong Answers
vi: Số câu trả lời sai

source: Accuracy Rate
vi: Tỷ lệ chính xác

source: Quiz Result
vi: Kết quả câu hỏi
